import {Component, EventEmitter, Input, OnChanges, OnInit, Output} from '@angular/core';
import {FormControl, FormGroup} from "@angular/forms";

@Component({
    selector: 'app-filters',
    templateUrl: './filters.component.html',
    styleUrls: ['./filters.component.css']
})
export class FiltersComponent implements OnChanges {
    @Input() public fixedChoosen: boolean = false;
    @Input() public recomChoosen: boolean = false;
    @Output() selectedFilters = new EventEmitter();
    @Output() selectedFilters1 = new EventEmitter();
    @Output() selectedFilters2 = new EventEmitter();
    public types = ["киоск", "cпортивный объект", "библиотека", "МФЦ", "дом культуры или клуб"];
    public optTypes = ['Оптимизация на основе солвера', 'Эвристическая модель на основе kmeans'];
    public adm_area = [
        "Восточный административный округ",
        "Северо-Западный административный округ",
        "Западный административный округ",
        "Северо-Восточный административный округ",
        "Южный административный округ",
        "Северный административный округ",
        "Юго-Восточный административный округ",
        "Юго-Западный административный округ",
        "Центральный административный округ"
    ];
    public districts = [
        "район Вешняки",
        "район Матушкино",
        "район Старое Крюково",
        "район Строгино",
        "район Солнцево",
        "район Южное Медведково",
        "район Ивановское",
        "район Северное Тушино",
        "район Бирюлёво Восточное",
        "район Ново-Переделкино",
        "район Тропарёво-Никулино",
        "район Раменки",
        "район Проспект Вернадского",
        "Бескудниковский район",
        "Дмитровский район",
        "район Кузьминки",
        "район Западное Дегунино",
        "район Отрадное",
        "район Ясенево",
        "район Косино-Ухтомский",
        "Тимирязевский район",
        "район Фили-Давыдково",
        "Мещанский район",
        "район Сокольники",
        "район Люблино",
        "район Выхино-Жулебино",
        "район Покровское-Стрешнево",
        "район Перово",
        "район Беговой",
        "Головинский район",
        "район Ховрино",
        "район Царицыно",
        "район Хамовники",
        "район Зюзино",
        "район Лефортово",
        "район Аэропорт",
        "район Измайлово",
        "район Северное Медведково",
        "район Орехово-Борисово Северное",
        "район Бибирево",
        "район Лианозово",
        "район Восточное Дегунино",
        "район Северное Бутово",
        "Академический район",
        "район Хорошёво-Мнёвники",
        "район Очаково-Матвеевское",
        "район Братеево",
        "Алексеевский район",
        "Бабушкинский район",
        "район Марьина Роща",
        "район Ростокино",
        "район Марьино",
        "район Текстильщики",
        "Южнопортовый район",
        "Даниловский район",
        "Донской район",
        "Гагаринский район",
        "район Коньково",
        "Ломоносовский район",
        "район Тёплый Стан",
        "район Крюково",
        "район Марфино",
        "Алтуфьевский район",
        "Бутырский район",
        "Лосиноостровский район",
        "Останкинский район",
        "район Метрогородок",
        "район Богородское",
        "район Восточное Измайлово",
        "район Восточный",
        "район Преображенское",
        "район Соколиная Гора",
        "район Гольяново",
        "район Новокосино",
        "район Северное Измайлово",
        "район Новогиреево",
        "район Силино",
        "район Замоскворечье",
        "Обручевский район",
        "район Дорогомилово",
        "район Котловка",
        "район Черёмушки",
        "район Южное Бутово",
        "Можайский район",
        "Савёловский район",
        "район Крылатское",
        "район Южное Тушино",
        "район Кунцево",
        "район Свиблово",
        "район Зябликово",
        "район Печатники",
        "район Внуково",
        "район Арбат",
        "район Филёвский Парк",
        "Красносельский район",
        "Нагорный район",
        "район Орехово-Борисово Южное",
        "район Бирюлёво Западное",
        "Пресненский район",
        "Войковский район",
        "Рязанский район",
        "район Капотня",
        "Ярославский район",
        "район Нагатинский Затон",
        "район Чертаново Южное",
        "район Нагатино-Садовники",
        "район Чертаново Центральное",
        "район Чертаново Северное",
        "район Москворечье-Сабурово",
        "район Коптево",
        "район Сокол",
        "район Якиманка",
        "Басманный район",
        "район Митино",
        "район Щукино",
        "Таганский район",
        "Хорошёвский район",
        "район Некрасовка",
        "поселение Московский",
        "поселение Троицк",
        "Тверской район",
        "поселение Краснопахорское",
        "поселение Кленовское",
        "поселение Щербинка",
        "район Савёлки",
        "район Левобережный",
        "поселение Рязановское",
        "поселение Сосенское",
        "поселение Вороновское",
        "поселение Щаповское",
        "Нижегородский район",
        "поселение Марушкинское",
        "поселение Внуковское",
        "поселение Десеновское",
        "район Северный",
        "район Куркино",
        "поселение Филимонковское",
        "поселение Кокошкино",
        "поселение \"Мосрентген\"",
        "поселение Первомайское",
        "поселение Воскресенское",
        "поселение Михайлово-Ярцевское",
        "поселение Новофедоровское",
        "поселение Роговское",
        "поселение Киевский",
        "Молжаниновский район"
    ]
    public optionsForm: FormGroup;
    public optForm: FormGroup;
    public isFilters: boolean = true;
    public isOpt: boolean = false;
    public selectedOptimization: string = '';

    constructor() {
        this.optionsForm = new FormGroup({
            selectedTypes: new FormControl(),
            selectedArea: new FormControl(null),
            selectedDistricts: new FormControl(null),
            onlyRecommed: new FormControl(null),
            onlyBan: new FormControl(null),
            onlyDop: new FormControl(null),
            onlyFix: new FormControl(null),
            postamatQuant: new FormControl(1000),
            metroImportance: new FormControl(0.5),
            large_houses_priority: new FormControl(0.5),
            opt_time: new FormControl(100),
            max_time: new FormControl(15)
        })
        this.optForm = new FormGroup({
            optSelect: new FormControl(null),
        })
    }

    ngOnChanges(): void {
        this.optionsForm.patchValue({
            onlyRecommed: this.recomChoosen,
            onlyFix: this.fixedChoosen
        })

    }

    public test() {
        this.selectedFilters.emit(this.optionsForm.value);
    }

    public test1() {
        this.optionsForm.reset();
        this.selectedFilters1.emit(this.optionsForm.value);
    }

    public test2() {
        this.selectedFilters2.emit({form: this.optionsForm.value, typeOpt: this.optForm.value});
    }

    public setFilter() {
        this.isFilters = true;
        this.isOpt = false;
    }

    public setOpt() {
        this.isFilters = false;
        this.isOpt = true;
    }

    public changeTypeOpt() {
        this.selectedOptimization = this.optForm.value.optSelect;
    }
}
